NOTE:
-----

Please run the below cells first before proceeding- you'll need them soon!

In [ ]:
%load_ext sql
%sql sqlite:///dataset_1.db

Activity 4-2
------------
Aggregation operators, GROUP BY

Exercise #1
-----------

Consider a set of tables that describe the up-and-coming bagel startup industry; for now let's just look at two tables here, `bagel`, which describes types of bagels made by the different bagel companies:
> * name STRING
> * price FLOAT
> * made_by STRING

And `purchase`:
> * bagel_name STRING
> * franchise STRING
> * date INT
> * quantity INT
> * purchaser_age INT

Where `purchase.bagel_name` references `bagel.name` and `purchase.franchise` references `bagel.made_by`:

In [ ]:
%sql SELECT * FROM bagel LIMIT 3;

In [ ]:
%sql SELECT * FROM purchase LIMIT 3;

Can you write a query to get the _total revenue_ for each bagel type **which had an average purchaser age over 18**?  Type your query below:

In [ ]:
%%sql

In [20]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///dataset_1.db
Done.

[(u'Egg with shmear', 14.34), (u'Plain with shmear', 84.50999999999999)]

Exercise #2
-----------

Here we'll use a simplified version of the `precipitation_full` table, which just has _daily_ rainfall _in CA only_, and has the following schema:

> * station_id
> * day
> * precipitation

In [ ]:
%sql SELECT * FROM precipitation LIMIT 5;

We want to get station_ids which have average precipitations > 75.  Try doing this first as a nested query:

In [ ]:
%%sql

In [21]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///dataset_1.db
Done.

[(88302,), (250002,), (335701,), (357302,), (488301,)]

Now, try re-writing as a GROUP BY:

In [ ]:
%%sql

In [22]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///dataset_1.db
Done.

[(88302,), (250002,), (335701,), (357302,), (488301,)]

Now time it by using `%time` followed by single-line versions of your queries above (clunky, but will work) to see how they compare!

**Note:** Yes, currently the answers are filled in below for convenience... but you should still try getting them on your own above!

In [ ]:
%time %sql SELECT DISTINCT p.station_id FROM precipitation p WHERE (SELECT AVG(precipitation) FROM precipitation WHERE station_id = p.station_id) > 75;

In [ ]:
%time %sql SELECT p.station_id FROM precipitation p GROUP BY p.station_id HAVING AVG(p.precipitation) > 75;

**An ~ 10-20x difference in execution time!!**